INSERT INTO GENRE (name)
VALUES 
('Рок'),
('Классика'),
('Поп-музыка'),
('Техно'),
('Диско'),
('Шансон'),
('Авторская песня');


INSERT INTO ARTIST (name)
VALUES 
('Ария'),
('Браво'),
('Дискотека Авария'),
('Кино'),
('Владимир Высоцкий'),
('Игорь Крутой'),
('Сергей Трофимов'),
('Юли Савичева'),
('Yiruma'),
('The Immortals'),
('IM');

INSERT INTO Album (name, year_album)
VALUES 
('Ночь короче дня',1995),
('Дорога в облака',1994),
('Все хиты: Авария против!',2000),
('Группа крови',1988),
('Песня о Волге',1973),
('Без слов',2000),
('Я скучаю по тебе',2014),
('Ты вернёшься, знаю',2011),
('Piano',2015),
('The Rewritten Memories',2021),
('Frame', 2020),d
('Mortal Kombat: The Album',1994),
('My Album', 2018),
('Гость из царства теней', 2019);

INSERT INTO artistgenre 
VALUES 
(1,1),
(2,1),
(3,5),
(4,1),
(5,7),
(6,2),
(6,3),
(7,3),
(7,6),
(8,3),
(9,2),
(10,4),
(10,5),
(11,2);

INSERT INTO artistalbum 
VALUES 
(1,1),
(1,14),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,7),
(8,8),
(9,9),
(9,10),
(9,11),
(10,12),
(11,13);

INSERT INTO track (name, time_track_sec, album_id)
VALUES 
('Король дороги', 157, 1),
('Дух войны', 298, 1),
('Ночь короче дня',434,1),
('Дорога в облака',182,2),
('Однажды', 166, 2),
('Любите, девушки', 162, 2),
('Пей пиво!', 238, 3),
('Давай, Авария!', 263, 3),
('Группа крови', 283, 4),
('Закрой за мной дверь, я ухожу', 256, 4),
('Москва – Одесса', 149, 5),
('Здесь лапы у ели дрожат на весу', 281, 5),
('Я не люблю', 100, 5),
('Песнь о друге', 258, 6),
('Когда я закрываю глаза', 321, 6),
('Я скучаю по тебе', 265, 7),
('Ветерок', 218, 7),
('Ты вернёшься, знаю', 201, 8),
('Embrace of Silence', 173, 9),
('The Last Paradise', 213, 9),
('Piano', 150,9),
('Kiss the Rain',285, 10),
('River Flows in You', 285, 10),
('Nocturnal Mind', 194, 11),
('flower', 233, 11),
('Walking In The Forest', 187, 11),
('A Moonlight Song', 214, 11),
('Techno Syndrome (Mortal Kombat)', 205, 12),
('My track', 121, 13),
('Гонка за славой', 359, 14),
('Убить дракона', 392, 14),
('Герой асфальта', 316, 14);


INSERT INTO collection (name, year_col) 
VALUES 
('My_Collection_1',2010),
('My_Collection_2',2020),
('My_Collection_3',2018),
('My_Collection_4',2019),
('My_Collection_5',2015),
('My_Collection_6',2016),
('My_Collection_7',2017),
('My_Collection_8',2021);

INSERT INTO trackcollection (collection_id, track_id)
VALUES
(1,5),
(1,6),
(1,15),
(1,25),
(2,10),
(2,11),
(2,30),
(2,32),
(3,14),
(3,22),
(4,22),
(4,23),
(4,14),
(5,10),
(5,11),
(5,16),
(6,20),
(6,23),
(6,6),
(7,3),
(7,4),
(7,25),
(7,24),
(8,19),
(8,29),
(8,27),
(8,26),
(8,5);


